app/controllers/articles_controller.rb

INSERT INTO "articles" ("body", "created_at", "title", "updated_at") VALUES (?, ?, ?, ?)  [["body", "cats r not coo,l"], ["created_at", "2014-11-24 19:44:51.111329"], ["title", "cats"], ["updated_at", "2014-11-24 19:44:51.111329"]]
---
	def create
		@article = Article.new(article_params)
		@article.save

SELECT  "articles".* FROM "articles"  WHERE "articles"."id" = ? LIMIT 1  [["id", 9]]
UPDATE "articles" SET "body" = ?, "title" = ?, "updated_at" = ? WHERE "articles"."id" = 9  [["body", "no way skipper"], ["title", "a dog!"], ["updated_at", "2014-11-24 20:21:06.547647"]]
---
	def update
  	@article = Article.find(params[:id])
  	@article.update(article_params)